# Learning to use pandas
Tecnun - UNAV
Winter Course 2019 <p>
drosquete@ceit.es

## First step: Always import the libraries
There are 2 ways to import, one is to import the <b>core</b> library; or import a specific function or part or whole lib using *
* <code> import pandas as pd </code>
* <code> from pandas import read_csv </code>

In [1]:
import pandas as pd
import numpy as np

## Second step: Load the data
In most of the scenarios we are going to have a csv. So pandas have a function named read_csv with several parameters. A subset:
* skip_blank_lines: It allows you to avoid blank lines if the csv has some
* names: list of column names, in case the csv doesn't have it already
* dtype: Data type for data or columns. E.g. {‘a’: np.float64, ‘b’: np.int32}
* infer_datetime_format: If True and parse_dates is enabled, pandas will attempt to infer the format of the datetime strings in the columns

In [2]:
# People-example.csv is a toyfile well setted.
df = pd.read_csv('people-example.csv')

## Third step: Inspect the dataframe
Let's use some operations to check on the dataframe

In [3]:
df

  First Name Last Name        Country  age  Savings
0        Bob     Smith  United States   24  1000000
1      Alice  Williams         Canada   23   300000
2    Malcolm      Jone        England   22   450000
3      Felix     Brown            USA   23   500000
4       Alex    Cooper         Poland   23   230000
5        Tod  Campbell  United States   22  4500000
6      Derek      Ward    Switzerland   25   560000
7        Jon       Doe  United States   23    45000

If I want to see the first 5 elements

In [4]:
df.head()

  First Name Last Name        Country  age  Savings
0        Bob     Smith  United States   24  1000000
1      Alice  Williams         Canada   23   300000
2    Malcolm      Jone        England   22   450000
3      Felix     Brown            USA   23   500000
4       Alex    Cooper         Poland   23   230000

If I want to see the last 5 elements

In [5]:
df.tail()

  First Name Last Name        Country  age  Savings
3      Felix     Brown            USA   23   500000
4       Alex    Cooper         Poland   23   230000
5        Tod  Campbell  United States   22  4500000
6      Derek      Ward    Switzerland   25   560000
7        Jon       Doe  United States   23    45000

If you want to filter a specific column and have a Pandas.Series returned

In [8]:
df['Country'] # Or df.Country

0    United States
1           Canada
2          England
3              USA
4           Poland
5    United States
6      Switzerland
7    United States
Name: Country, dtype: object

In [7]:
df[['Country','age']]

         Country  age
0  United States   24
1         Canada   23
2        England   22
3            USA   23
4         Poland   23
5  United States   22
6    Switzerland   25
7  United States   23

In [9]:
type(df['Country'])

pandas.core.series.Series

But if you want to have a ndArray (Numpy). You should use "values"

In [10]:
df['Country'].values

array(['United States', 'Canada', 'England', 'USA', 'Poland',
       'United States', 'Switzerland', 'United States'], dtype=object)

In [11]:
type(df['Country'].values)

numpy.ndarray

### Keep looking at the DataFrame
See, if you have numerical series, there are operations you may execute

In [12]:
df['age']

0    24
1    23
2    22
3    23
4    23
5    22
6    25
7    23
Name: age, dtype: int64

In [13]:
df['age'].max()

25

In [14]:
df['age'].mean()

23.125


Since the DataFrame only has 1 numerical column, there is an operation call describe, that analyze every numerical column. In this case, Age and Savings

In [15]:
#If you want to avoid scientific notation pd.set_option('display.float_format', lambda x: '%.2f' % x)
df.describe()

             age       Savings
count   8.000000  8.000000e+00
mean   23.125000  9.481250e+05
std     0.991031  1.462361e+06
min    22.000000  4.500000e+04
25%    22.750000  2.825000e+05
50%    23.000000  4.750000e+05
75%    23.250000  6.700000e+05
max    25.000000  4.500000e+06

## Operations with the dataframe itself

### Rename columns

In [16]:
df2 = df.rename(columns={'First Name':'First','Last Name':'Last'})
df2

     First      Last        Country  age  Savings
0      Bob     Smith  United States   24  1000000
1    Alice  Williams         Canada   23   300000
2  Malcolm      Jone        England   22   450000
3    Felix     Brown            USA   23   500000
4     Alex    Cooper         Poland   23   230000
5      Tod  Campbell  United States   22  4500000
6    Derek      Ward    Switzerland   25   560000
7      Jon       Doe  United States   23    45000

### Concatenate String in a new column

In [17]:
df['FullName'] = df['First Name'] + ' ' + df['Last Name']

In [18]:
df

  First Name Last Name        Country  age  Savings        FullName
0        Bob     Smith  United States   24  1000000       Bob Smith
1      Alice  Williams         Canada   23   300000  Alice Williams
2    Malcolm      Jone        England   22   450000    Malcolm Jone
3      Felix     Brown            USA   23   500000     Felix Brown
4       Alex    Cooper         Poland   23   230000     Alex Cooper
5        Tod  Campbell  United States   22  4500000    Tod Campbell
6      Derek      Ward    Switzerland   25   560000      Derek Ward
7        Jon       Doe  United States   23    45000         Jon Doe

### Removing Columns

In [19]:
#Let's add a new column with a blank space
df['Full Name'] = df['First Name'] + ' ' + df['Last Name']

In [20]:
df

,First Name,Last Name,Country,age,Savings,FullName,Full Name
0,Bob,Smith,United States,24,1000000,Bob Smith,Bob Smith
1,Alice,Williams,Canada,23,300000,Alice Williams,Alice Williams
2,Malcolm,Jone,England,22,450000,Malcolm Jone,Malcolm Jone
3,Felix,Brown,USA,23,500000,Felix Brown,Felix Brown
4,Alex,Cooper,Poland,23,230000,Alex Cooper,Alex Cooper
5,Tod,Campbell,United States,22,4500000,Tod Campbell,Tod Campbell
6,Derek,Ward,Switzerland,25,560000,Derek Ward,Derek Ward
7,Jon,Doe,United States,23,45000,Jon Doe,Jon Doe

The operation <b><code>drop</code></b> makes the magic. Let's remove the column. The axis = 1 is the column, the inplace indicates an overwrite

In [21]:
df.drop('FullName',axis=1,inplace=True)

In [22]:
df

  First Name Last Name        Country  age  Savings       Full Name
0        Bob     Smith  United States   24  1000000       Bob Smith
1      Alice  Williams         Canada   23   300000  Alice Williams
2    Malcolm      Jone        England   22   450000    Malcolm Jone
3      Felix     Brown            USA   23   500000     Felix Brown
4       Alex    Cooper         Poland   23   230000     Alex Cooper
5        Tod  Campbell  United States   22  4500000    Tod Campbell
6      Derek      Ward    Switzerland   25   560000      Derek Ward
7        Jon       Doe  United States   23    45000         Jon Doe

## Editing columns

As you can see, in country there is 'United States' and 'USA'.
This is usual in Data Science, let's make a function to unify
the names

In [23]:
def transformCountry(country):
    if(country=='USA'):
        return 'United States'
    else:
        return country

In [24]:
# Let's see if this function works
transformCountry('Spain')

'Spain'

In [25]:
transformCountry('USA')

'United States'

### Important:
When you want to change values using a function, you must call the apply function from the dataframe. It allows to apply the function in every single row of the column(s) listed. Is vectorized and parallel when available.<p>

In [26]:
df['Country'].apply(transformCountry)

0    United States
1           Canada
2          England
3    United States
4           Poland
5    United States
6      Switzerland
7    United States
Name: Country, dtype: object

The changes were executed, but not stored on the dataframe, the apply function doesn't have an inplace parameter.

### RESEARCH

Now, let's do this, the python way! Using a lambda function on an apply. Take in consideration that when it comes to the conditional statements (as if), the structure is the following: &lt; ResponseIfTrue &gt; &lt; Condition &gt; &lt; Else &gt;  &lt; ResponseElse &gt;

In [27]:
df['Country'] = df['Country'].apply(lambda x: 'United States' if x == 'USA'  else x)

In [28]:
df

  First Name Last Name        Country  age  Savings       Full Name
0        Bob     Smith  United States   24  1000000       Bob Smith
1      Alice  Williams         Canada   23   300000  Alice Williams
2    Malcolm      Jone        England   22   450000    Malcolm Jone
3      Felix     Brown  United States   23   500000     Felix Brown
4       Alex    Cooper         Poland   23   230000     Alex Cooper
5        Tod  Campbell  United States   22  4500000    Tod Campbell
6      Derek      Ward    Switzerland   25   560000      Derek Ward
7        Jon       Doe  United States   23    45000         Jon Doe

### END RESEARCH

### Sorting values
Is easy to do, it takes many parameters, as axis, inplace, ascending (True or False)

In [29]:
df.sort_values('age')

  First Name Last Name        Country  age  Savings       Full Name
2    Malcolm      Jone        England   22   450000    Malcolm Jone
5        Tod  Campbell  United States   22  4500000    Tod Campbell
1      Alice  Williams         Canada   23   300000  Alice Williams
3      Felix     Brown  United States   23   500000     Felix Brown
4       Alex    Cooper         Poland   23   230000     Alex Cooper
7        Jon       Doe  United States   23    45000         Jon Doe
0        Bob     Smith  United States   24  1000000       Bob Smith
6      Derek      Ward    Switzerland   25   560000      Derek Ward

### RESEARCH

## What if I want to generate the data?

There are many parameters to create a DataFrame, the best is to check the documentation or examples for specific scenarios. In our case, let's create a couple of simple dataframes :-)<p>
The first parameter is between brackets, indicating the data that is going in.<p>
Using the name first indicates the column name, and then the values inside it using brackets.<p>
All the values are between quotes because they are strings.<p>
Finally, the value index, indicating the name of the row.

In [30]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3']},
                    index=[0,1,2,3])
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

In [31]:
df2 = pd.DataFrame({'A': ['A5', 'A6'],
                    'B': ['B5', 'B6'],
                    'C': ['C5', 'C6']},
                    index=[5,6])
df2

    A   B   C
5  A5  B5  C5
6  A6  B6  C6

In [32]:
df3 = pd.DataFrame({'A': ['A7', 'A8'],
                    'B': ['B7', 'B8']},
                    index=[7,8])
df3

    A   B
7  A7  B7
8  A8  B8

In [33]:
usingRandomDF = pd.DataFrame({'A':np.random.random(5),
                              'B':np.random.random(5)})
usingRandomDF

          A         B
0  0.408638  0.641839
1  0.526002  0.481945
2  0.528760  0.008242
3  0.654718  0.520097
4  0.171983  0.062237

Well, now we know how to create dataframes. 
<p>
## But... what happens if I want to merge them?<p>
Sometimes the data is splitted on several tables, and we need to put them together in just one. For example, df1 and df2 shares the same columns! So, let's merge them<p>
* Step 1: Put them together on a list, indicating the vertical order you want to merge them
* Step 2: call the pandas concat with this list

In [34]:
frames = [df1,df2]

In [35]:
frames

[    A   B   C
 0  A0  B0  C0
 1  A1  B1  C1
 2  A2  B2  C2
 3  A3  B3  C3,     A   B   C
 5  A5  B5  C5
 6  A6  B6  C6]

In [36]:
type(frames)

list

In [37]:
pd.concat(frames)

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
5  A5  B5  C5
6  A6  B6  C6

The index may not be sorted or even continuos. F.E.

In [38]:
pd.concat([df2,df1])

    A   B   C
5  A5  B5  C5
6  A6  B6  C6
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

But what happens if not all the columns match? F.E. Df3.

In [39]:
frames2 = [df1,df3,df2]

In [40]:
pd.concat(frames2)

D:\Users\DRosquete\anaconda-envs\Winter\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    A   B    C
0  A0  B0   C0
1  A1  B1   C1
2  A2  B2   C2
3  A3  B3   C3
7  A7  B7  NaN
8  A8  B8  NaN
5  A5  B5   C5
6  A6  B6   C6

Great scenarios... but... really? What will you do if the rows overlap?

In [41]:
df4 = pd.DataFrame({'A': ['A-7','A-8'],
                    'C': ['C7','C8']},
                    index=[7,8])

In [42]:
df4

     A   C
7  A-7  C7
8  A-8  C8

In [43]:
pd.concat([df3,df4])

D:\Users\DRosquete\anaconda-envs\Winter\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     A    B    C
7   A7   B7  NaN
8   A8   B8  NaN
7  A-7  NaN   C7
8  A-8  NaN   C8

What a mess!!! Now I dont know which cell belongs to which dataframe!!!

In [44]:
pd.concat([df3,df4],keys=['df3','df4'])

D:\Users\DRosquete\anaconda-envs\Winter\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

         A    B    C
df3 7   A7   B7  NaN
    8   A8   B8  NaN
df4 7  A-7  NaN   C7
    8  A-8  NaN   C8

Wonderful!!! Was that magic?<p>
No, it was keys, using them is a great separator to check data on several DF.

Show me if you can filter from keys, if I just want to see a section.

In [45]:
merged1 = pd.concat([df3,df4],keys=['df3','df4'])
merged1.loc['df3']

D:\Users\DRosquete\anaconda-envs\Winter\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    A   B    C
7  A7  B7  NaN
8  A8  B8  NaN

<b> Important: </b> Research about <code>loc</code> and <code>iloc</code> function

Man! It is not possible that pandas can manage every single combination... Let's see.<p>
What if I want to merge all values from df3 and df4 in one single dataframe? To avoid the NaN

In [46]:
pd.concat([df3,df4],axis=1)

    A   B    A   C
7  A7  B7  A-7  C7
8  A8  B8  A-8  C8

No no no, that's not what I meant! Merging the same column names.

#### combine_first, takes the dataframe (Df3) values as priority, if both have coincidence in the columns

In [47]:
df5 = df3.combine_first(df4)
df5

    A   B   C
7  A7  B7  C7
8  A8  B8  C8

<b> HOLY MACARRONI!!! </b><p>
That's exactly what I wanted!

Let's merge the bigger dataframe now!

In [48]:
frames = [df1,df2,df5]

In [49]:
pd.concat(frames)

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

### END RESEARCH

## The famous, the one and only: Groupby!
As in SQL we can group many values of a DataFrame if we consider at least, 1 categorical column. For example, people with same ages, or people of a gender.<p>
The big deal with groupby is, that it creates an object of its own type. Which you can later operate as we will see now.

In [50]:
df.groupby('age')

Lets sum how many people are with each categorical age.

In [51]:
df.groupby('age').size()

age
22    2
23    4
24    1
25    1
dtype: int64

In [52]:
df.groupby('Country').size()

Country
Canada           1
England          1
Poland           1
Switzerland      1
United States    4
dtype: int64

Other operations may be used. For example, describe

In [53]:
df.groupby(['Country']).describe()

              Savings                                                         \
                count       mean           std       min       25%       50%
Country
Canada            1.0   300000.0           NaN  300000.0  300000.0  300000.0
England           1.0   450000.0           NaN  450000.0  450000.0  450000.0
Poland            1.0   230000.0           NaN  230000.0  230000.0  230000.0
Switzerland       1.0   560000.0           NaN  560000.0  560000.0  560000.0
United States     4.0  1511250.0  2.030314e+06   45000.0  386250.0  750000.0

                                      age                                     \
                     75%        max count  mean       std   min    25%   50%
Country
Canada          300000.0   300000.0   1.0  23.0       NaN  23.0  23.00  23.0
England         450000.0   450000.0   1.0  22.0       NaN  22.0  22.00  22.0
Poland          230000.0   230000.0   1.0  23.0       NaN  23.0  23.00  23.0
Switzerland     560000.0   560000.0   1.0  25.0       NaN  25.0  25.00  25.0
United States  1875000.0  4500000.0   4.0  23.0  0.816497  22.0  22.75  23.0


                 75%   max
Country
Canada         23.00  23.0
England        22.00  22.0
Poland         23.00  23.0
Switzerland    25.00  25.0
United States  23.25  24.0

Or use it with several columns

In [54]:
df.groupby(['Country','age']).describe()

                  Savings                                                 \
                    count       mean           std        min        25%
Country       age
Canada        23      1.0   300000.0           NaN   300000.0   300000.0
England       22      1.0   450000.0           NaN   450000.0   450000.0
Poland        23      1.0   230000.0           NaN   230000.0   230000.0
Switzerland   25      1.0   560000.0           NaN   560000.0   560000.0
United States 22      1.0  4500000.0           NaN  4500000.0  4500000.0
              23      2.0   272500.0  321733.58544    45000.0   158750.0
              24      1.0  1000000.0           NaN  1000000.0  1000000.0


                         50%        75%        max
Country       age
Canada        23    300000.0   300000.0   300000.0
England       22    450000.0   450000.0   450000.0
Poland        23    230000.0   230000.0   230000.0
Switzerland   25    560000.0   560000.0   560000.0
United States 22   4500000.0  4500000.0  4500000.0
              23    272500.0   386250.0   500000.0
              24   1000000.0  1000000.0  1000000.0

### RESEARCH
## Question: ¿Which is the sum of the savings of all the people with 23 years living in USA?
In the following line, the idea is to group by age, then by country, and in each classification group, calculate from the Savings, the mean and the sum. Notice, that in the row 23-United States, there are 2 people, in that specific row, you will see how Agg works

In [55]:
df.groupby(['age','Country'])['Savings'].agg(['mean','sum'])

                      mean      sum
age Country
22  England         450000   450000
    United States  4500000  4500000
23  Canada          300000   300000
    Poland          230000   230000
    United States   272500   545000
24  United States  1000000  1000000
25  Switzerland     560000   560000